In [1]:
import pandas as pd

In [20]:
ds = pd.read_csv("loan.csv")

In [21]:
ds.isnull().sum()

Loan_ID               0
Gender               83
Married              89
Dependents           47
Education             0
Self_Employed        95
ApplicantIncome       0
CoapplicantIncome    79
LoanAmount            0
Loan_Amount_Term     38
Credit_History       87
Property_Area        76
Loan_Status           0
dtype: int64

In [22]:
ds["Gender"] = ds["Gender"].fillna(ds["Gender"].mode()[0])

In [23]:
ds["Married"] = ds["Married"].fillna(ds["Married"].mode()[0])

In [24]:
req_data = ds[["Gender","Married"]]

In [26]:
req_data.isnull().sum()

Gender     0
Married    0
dtype: int64

In [28]:
pd.get_dummies(req_data)

     Gender_Female  Gender_Male  Married_No  Married_Yes
0            False         True       False         True
1            False         True       False         True
2            False         True        True        False
3            False         True        True        False
4            False         True       False         True
..             ...          ...         ...          ...
245           True        False       False         True
246          False         True       False         True
247          False         True       False         True
248           True        False       False         True
249          False         True       False         True

[250 rows x 4 columns]

#this return boolean value but we need numerical values

In [29]:
from sklearn.preprocessing import OneHotEncoder

In [50]:
x = OneHotEncoder()
y = OneHotEncoder(drop = "first")

In [51]:
a = x.fit_transform(req_data).toarray()
b = y.fit_transform(req_data).toarray()

In [54]:
new_data = pd.DataFrame(a, columns = ["Male","Female","Marriege", "Unmarriege"])
new_data1 = pd.DataFrame(b, columns = ["Male","Marriege"])

In [55]:
new_data

     Male  Female  Marriege  Unmarriege
0     0.0     1.0       0.0         1.0
1     0.0     1.0       0.0         1.0
2     0.0     1.0       1.0         0.0
3     0.0     1.0       1.0         0.0
4     0.0     1.0       0.0         1.0
..    ...     ...       ...         ...
245   1.0     0.0       0.0         1.0
246   0.0     1.0       0.0         1.0
247   0.0     1.0       0.0         1.0
248   1.0     0.0       0.0         1.0
249   0.0     1.0       0.0         1.0

[250 rows x 4 columns]

In [56]:
new_data1

     Male  Marriege
0     1.0       1.0
1     1.0       1.0
2     1.0       0.0
3     1.0       0.0
4     1.0       1.0
..    ...       ...
245   0.0       1.0
246   1.0       1.0
247   1.0       1.0
248   0.0       1.0
249   1.0       1.0

[250 rows x 2 columns]